Day4/exercise/movieforum/app/controllers/movie_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."title" IS NULL LIMIT 1
---
  def search
    @movie = Movie.find_by(title: params[:title])