Day2/exercise/address_book/app/controllers/contacts_controller.rb

  def create
    contact = Contact.new(
      :name => params[:contact][:name],
      :address => params[:contact][:address],
      :phone_number => params[:contact][:phone_number],
      :email => params[:contact][:email])
    Contact.create_contact(contact)
---
INSERT INTO "contacts" ("name", "address", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["address", ""], ["email", ""], ["created_at", "2016-04-26 13:40:13.137037"], ["updated_at", "2016-04-26 13:40:13.137037"]]

  def show
    @contact = Contact.find_by_id(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", nil]]

  def favorites
    contact = Contact.find_by_id(params[:id])
    contact.make_favorite
    #binding.pry
    contact.save
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "contacts" SET "favorites" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["favorites", "t"], ["updated_at", "2016-04-26 16:36:36.281038"], ["id", 1]]