Day3/ejercicios_clase/timetracking/app/controllers/time_entries_controller.rb

  def index
    @project = Project.find_by(id: params[:project_id])
    if @project == nil
      render :no_projects_found
    else
      @time_entries = @project.time_entries.where
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
SELECT "time_entries".* FROM "time_entries" WHERE "time_entries"."project_id" = ?  [["project_id", 2]]

  def new
    @project = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 3]]