Day3/exercise/auctionsite/app/controllers/users_controller.rb

  def index
    @users = User.all.order("lower(name) ASC")
---
SELECT "users".* FROM "users"  ORDER BY lower(name) ASC

  def create
    @user = User.new(
      name: params[:user][:name],
      email: params[:user][:email]
    )
    @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "caca"], ["email", "futi@mail.com"], ["created_at", "2016-04-27 15:16:26.416814"], ["updated_at", "2016-04-27 15:16:26.416814"]]

  def destroy
    User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 11]]