Day4/ejercicios_clase/timetracking/app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @project = Project.find_by(id: params[:id])

INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "asd"], ["description", "dsf"], ["created_at", "2016-04-27 08:17:52.708339"], ["updated_at", "2016-04-27 08:17:52.708339"]]
---
  def create
    @my_project = Project.new(
    name: params[:project][:name],
    description: params[:project][:description]
    )
    @my_project.save