Day4/ejercicios_clase/timetracking/app/controllers/time_entries_controller.rb

SELECT "time_entries".* FROM "time_entries" WHERE "time_entries"."project_id" = ?  [["project_id", 2]]
---
  def index
    #@project = Project.find_by(id: params[:project_id])
    if @project == nil
      render :no_projects_found
    else
      @time_entries = @project.time_entries.all

INSERT INTO "time_entries" ("hours", "minutes", "comment", "date", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@project = Project.find(params[:project_id])
    @time_entry = @project.time_entries.new(entry_params)
    if @time_entry.save

SELECT  "time_entries".* FROM "time_entries" WHERE "time_entries"."project_id" = ? AND "time_entries"."id" = ? LIMIT 1  [["project_id", 3], ["id", 1]]
---
  def edit
    #@project = Project.find(params[:project_id])
    @time_entry = @project.time_entries.find(params[:id])

SELECT  "time_entries".* FROM "time_entries" WHERE "time_entries"."project_id" = ? AND "time_entries"."id" = ? LIMIT 1  [["project_id", 3], ["id", 3]]
UPDATE "time_entries" SET "minutes" = ?, "comment" = ?, "date" = ?, "updated_at" = ? WHERE "time_entries"."id" = ?  [["minutes", 32], ["comment", "jajajsidhasidia"], ["date", "2016-04-27 00:00:00.000000"], ["updated_at", "2016-04-28 09:23:41.040359"], ["id", 3]]
---
  def update
    #@project = Project.find(params[:project_id])
    @time_entry = @project.time_entries.find(params[:id])
    if @time_entry.update(entry_params)

SELECT  "time_entries".* FROM "time_entries" WHERE "time_entries"."project_id" = ? AND "time_entries"."id" = ? LIMIT 1  [["project_id", 3], ["id", 3]]
DELETE FROM "time_entries" WHERE "time_entries"."id" = ?  [["id", 3]]
---
  def destroy
    time_entry = @project.time_entries.find_by(id: params[:id])
    time_entry.destroy