Day5/concertnetwork/app/controllers/concerts_controller.rb

SELECT "concerts".* FROM "concerts" WHERE ("concerts"."date" BETWEEN '2016-04-29 23:59:59.999999' AND '2016-05-29 23:59:59.999999')  ORDER BY date ASC
---
  def index
    #@concerts = Concert.all.order("date ASC")
    @concerts = Concert.where(date: Date.today.end_of_day .. (Date.today.end_of_day + 1.month)).order("date ASC")

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", 4]]
---
  def show
    @concert = Concert.find(params[:id])

INSERT INTO "concerts" ("artist", "venue", "city", "date", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @concert = Concert.new concert_params
    if @concert.save